[Laboratory_AdditionalResearchStation X2FacilityUpgradeTemplate]
DisplayName="Additional Staffslot - Tier 1"
Summary="Adds another staffslot for 1 more Scientist which can help to decrease Laboratory research time."

[Laboratory_Level_2 X2FacilityUpgradeTemplate]
DisplayName="Additional Staffslot - Tier 2"
Summary="Adds another staffslot for 1 more Scientist which can help to decrease Laboratory research time."

[Laboratory_Level_3 X2FacilityUpgradeTemplate]
DisplayName="Additional Staffslot - Tier 3"
Summary="Adds another staffslot for 1 more Scientist which can help to decrease Laboratory research time."

[LaboratoryStaffSlot X2StaffSlotTemplate]
BonusText="RESEARCH TIME -%AVENGERBONUS%"
FilledText="%UNITNAME is providing additional science expertise, decreasing Laboratory research time!"

[Laboratory X2FacilityTemplate]
CompletedSummary="New Staff Slot Available - Decreases Research Time"
Summary="Each laboratory increases the chance that a research breakthrough will occur. Scientists can be staffed in laboratories to provide additional assistance to Dr. Tygan, further decreasing the time of all research projects."

